{
  "id": "rampage-rmp-2g",
  "chassis": "Rampage",
  "model": "RMP-2G",
  "unitType": "BattleMech",
  "configuration": "Biped",
  "techBase": "INNER_SPHERE",
  "rulesLevel": "STANDARD",
  "era": "STAR_LEAGUE",
  "year": 2735,
  "tonnage": 85,
  "engine": {
    "type": "FUSION",
    "rating": 255
  },
  "gyro": {
    "type": "STANDARD"
  },
  "cockpit": "STANDARD",
  "structure": {
    "type": "STANDARD"
  },
  "armor": {
    "type": "STANDARD",
    "allocation": {
      "LEFT_ARM": 24,
      "RIGHT_ARM": 24,
      "LEFT_TORSO": {
        "front": 23,
        "rear": 8
      },
      "RIGHT_TORSO": {
        "front": 23,
        "rear": 8
      },
      "CENTER_TORSO": {
        "front": 32,
        "rear": 11
      },
      "HEAD": 9,
      "LEFT_LEG": 31,
      "RIGHT_LEG": 31
    }
  },
  "heatSinks": {
    "type": "SINGLE",
    "count": 23
  },
  "movement": {
    "walk": 3,
    "jump": 0
  },
  "equipment": [
    {
      "id": "lrm-10",
      "location": "LEFT_ARM"
    },
    {
      "id": "ac-10",
      "location": "RIGHT_ARM"
    },
    {
      "id": "medium-laser",
      "location": "LEFT_TORSO"
    },
    {
      "id": "flamer",
      "location": "LEFT_TORSO"
    },
    {
      "id": "machine-gun",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "medium-laser",
      "location": "RIGHT_TORSO"
    },
    {
      "id": "large-laser",
      "location": "CENTER_TORSO"
    }
  ],
  "criticalSlots": {
    "LEFT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "LRM 10",
      "LRM 10",
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "RIGHT_ARM": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      "Autocannon/10",
      null
    ],
    "LEFT_TORSO": [
      "Medium Laser",
      "Flamer",
      "IS Ammo LRM-10",
      "IS Ammo LRM-10",
      "Heat Sink",
      "Heat Sink",
      "Heat Sink",
      "Heat Sink",
      "Heat Sink",
      null,
      null,
      null
    ],
    "RIGHT_TORSO": [
      "Machine Gun",
      "Medium Laser",
      "IS Ammo AC/10",
      "IS Ammo AC/10",
      "IS Ammo MG - Full",
      "Heat Sink",
      "Heat Sink",
      "Heat Sink",
      "Heat Sink",
      null,
      null,
      null
    ],
    "CENTER_TORSO": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Large Laser",
      "Large Laser"
    ],
    "HEAD": [
      "Life Support",
      "Sensors",
      "Cockpit",
      null,
      "Sensors",
      "Life Support"
    ],
    "LEFT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ],
    "RIGHT_LEG": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ]
  },
  "quirks": [
    "bad_rep_is",
    "obsolete:2780",
    "bad_rep_clan",
    "vestigial_hands_ra"
  ],
  "fluff": {
    "overview": "<p>The Rampage traces its origins to 2735 when Weigel Armory and Munitions introduced it as a standard assault 'Mech for the Rim Worlds Republic Army. For over three decades, the design served adequately as a heavy line unit, unremarkable among the Republic's military forces. Everything changed in 2767 following Stefan Amaris' coup against the Terran Hegemony. With access to Star League research facilities and advanced technology, Amaris ordered Hegemony engineers to transform the pedestrian Rampage into something far more dangerous. The resulting RMP-5G upgrade turned a forgettable assault 'Mech into a fast, hard-hitting platform that would plague Star League Defense Force units throughout the Amaris-Kerensky Civil War. The Rampage earned an infamous reputation during this conflict, becoming synonymous with the brutality of the Rim Worlds occupation.</p>",
    "capabilities": "<p>The redesigned Rampage was built to be fast for its size. Though some designers pushed for a top speed in the eighty-kilometer-per-hour range, they debated whether to accomplish this by lightening the entire design or by employing an experimental extralight engine. As a more economical compromise, they opted for an XL engine augmented by a MASC system, enabling the Rampage to reach almost ninety kilometers per hour in short bursts. This unexpected mobility allows it to serve as a fast strike unit or provide heavy support for medium 'Mech formations. More than one opponent assumed they could use a heavy medium to outmaneuver the Rampage, only to find themselves facing its formidable firepower at close range.</p>",
    "history": "<p>The Rampage's history is inextricably linked to the Rim Worlds Republic and its treacherous assault on the Star League. Weigel Armory and Munitions constructed the original design at a secret facility on Kwangjong-ni, built half a kilometer beneath the planet's Lost Sea to mask its heat signature and hidden from Star League oversight. The factory's tunnels connected directly to the planetary garrison in the Britton mountains, allowing newly manufactured 'Mechs to be quietly integrated into Republic units before deployment. This clandestine production supported the Republic's secret military buildup for decades before the coup.</p>",
    "deployment": "<p>The original Rampage variant produced for decades in the Rim Worlds Republic was twenty-five percent slower than the 5G. The 2G lacked the Streak launchers and Artemis IV fire control systems of its successor, instead mounting an autocannon/10 with two tons of ammunition, an LRM-10 also with two tons of ammunition, a large laser, two medium lasers, and a flamer. Instead of the 5G's anti-missile system, the 2G mounted a single machine gun with a full ton of ammunition for anti-infantry work. Though this older model boasted ten more heat sinks than the 5G, these standard sinks lacked the efficiency of the 5G's double heat sink system, relegating the variant to garrison duties once superior models entered production.</p>",
    "manufacturer": "Weigel Armory and Munitions",
    "primaryFactory": "Kwangjong-ni",
    "systemManufacturer": {
      "CHASSIS": "Stanwhich 850",
      "ENGINE": "AMC 340 XL",
      "ARMOR": "PanzerSlab Type 9",
      "COMMUNICATIONS": "Transcom Alpha",
      "TARGETING": "KBC Starsight Model 3"
    }
  },
  "mulId": 2635,
  "role": "Juggernaut",
  "source": "ISP2"
}
